2D-coarse2-105-NEW-62-TRANSIENT-DES-blastReactingFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
   "libhisaFiniteVolume.so"
    "libmomentumTransportModels.so"
   "libcompressibleMomentumTransportModels.so"
   "libfindroot.so"
);

application     blastFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.25;

deltaT          1e-8;

writeControl    adjustableRunTime;

writeInterval    0.5e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

maxCo    0.01;

maxDeltaT       1e-5;

adjustTimeStep no;

functions
{
    #includeFunc MachNo
    #includeFunc yPlus
    #includeFunc writeCellCentres
    #includeFunc vorticity
    #includeFunc grad(p)
    #includeFunc fieldAverage(U, p, prime2Mean = yes)
}
// ************************************************************************* //
